# Common
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# for Font
tap "delphinus/sfmono-square"

# for evans
# tap "ktr0731/evans"

# for buf
# tap "bufbuild/buf"

# Common
brew "anyenv"
brew "ansible"
brew "gcc"
brew "gh"
brew "git"
brew "git-secrets"
brew "go", link:true
brew "grep"
brew "jq"
brew "libpq"
brew "sfmono-square"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"

# Personal
# brew "hugo"
# brew "kind"
# brew "nmap"
# brew "pstree"

# Work
# brew "azure-cli"
# brew "buf"
# brew "direnv"
# brew "evans"
# brew "git-flow-avh"
# brew "golangci-lint"
# brew "helm"
# brew "istioctl"
# brew "kubectl"
# brew "kubectx"
# brew "protobuf"
# brew "python@3.11"
# brew "sops"

# Common
cask "1password"
cask "arc"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "grammarly"
cask "linear-linear"
cask "logi-options-plus"
cask "miro"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "notion"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# Personal
# cask "background-music"
# cask "burn"
# cask "logisim-evolution"
# cask "proxyman"

# Work
# cask "dbeaver-community"
# cask "google-cloud-sdk"
# cask "graphiql"

#####
vscode "arjun.swagger-viewer"
vscode "codingyu.laravel-goto-view"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryannaddy.laravel-artisan"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
