# Common
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# for evans
# tap "ktr0731/evans"

# for buf
# tap "bufbuild/buf"

# Common
brew "ansible"
brew "anyenv"
brew "claude-code"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-secrets"
brew "go", link:true
brew "jq"
brew "kube-ps1"
brew "lazygit"
brew "libpq"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"

# Personal
# brew "hugo"
# brew "kind"
# brew "nmap"
# brew "pstree"

# Work
# brew "azure-cli"
# brew "buf"
# brew "direnv"
# brew "evans"
# brew "git-flow-avh"
# brew "golangci-lint"
# brew "helm"
# brew "istioctl"
# brew "k6"
# brew "kubectx"
# brew "kubernetes-cli"
# brew "kustomize"
# brew "protobuf"
# brew "python@3.11"
# brew "sops"

# Common
cask "1password"
cask "alacritty"
cask "arc"
cask "cursor"
cask "discord"
cask "docker"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "logi-options+"
cask "miro"
cask "notion"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# Personal
# cask "background-music"
# cask "burn"
# cask "deepl"
# cask "grammarly"
# cask "logisim-evolution"

# Work
# cask "dbeaver-community"
# cask "gcloud-cli"
# cask "graphiql"
# cask "linear-linear"
# cask "postman"
# cask "proxyman"

#####
vscode "bierner.markdown-mermaid"
# vscode "codingyu.laravel-goto-view"
# vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
# vscode "devsense.composer-php-vscode"
# vscode "devsense.intelli-php-vscode"
# vscode "devsense.phptools-vscode"
# vscode "devsense.profiler-php-vscode"
vscode "dsznajder.es7-react-js-snippets"
# vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
# vscode "graphql.vscode-graphql"
# vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
# vscode "onecentlin.laravel-blade"
# vscode "onecentlin.laravel5-snippets"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
# vscode "ryannaddy.laravel-artisan"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
# vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
# vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
